wisteria-1c/Конфигурация/InformationRegisters/НастройкиВариантовОтчетовУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВариантовОтчетовУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Образец</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рекомендуемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункциональнаяОпция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзмененаПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыДополнительныхОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Требуется для подключения команд дополнительных отчетов и обработок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ПривязкаПолейОтчетовУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаПолейОтчетовУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СложныйАлгоритм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рекомендуемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИзмененаПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыДополнительныхОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйРазрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИсправленияПоступленияРеализации</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТТНВходящейЕГАИС</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказПоставщику</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЭД</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачисленияПоКредитамИЗаймам</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетФактураПолученный</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходСоСчета</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаданиеНаРаботу</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВКассу</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказПокупателя</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийНачислениеНалогов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСборкаЗапасов</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыСтруктурныхЕдиниц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКадровоеПеремещение</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежнаяВедомость</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходИзКассы</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТТНИсходящейЕГАИС</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеПоЯчейкам</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходнаяНакладная</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаимозачет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСчетФактура</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВыдачаИзРемонта</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВнешниеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеПользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАвторизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВнешнийПользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьРолиНепосредственно</Name>
					<Comment>Используется, если не встроена подсистема "Управление доступом"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ВариантыДополнительныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыДополнительныхОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКоманды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекстный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonForms/СохранениеВариантаОтчетаУНФ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	ПустаяКартинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПросмотрНедоступен);
	ВариантОбразец = ПустаяКартинка;

	НастройкиФормы = Новый Структура;
	Контекст = Новый Структура;
	Контекст.Вставить("РежимНастройки", Параметры.РежимНастройки);

	Если Не Контекст.РежимНастройки И (Параметры.Настройки = Неопределено Или Параметры.АдресСхемы = Неопределено) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Контекст.РежимНастройки И Не ЗначениеЗаполнено(Параметры.Вариант) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Контекст.Вставить("КлючОбъекта", Параметры.КлючОбъекта);

	Если ТипЗнч(Параметры.КлючОбъекта) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Или ТипЗнч(
		Параметры.КлючОбъекта) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений") Тогда
		ПолноеИмя = Параметры.КлючОбъекта.ПолноеИмя;
	ИначеЕсли ТипЗнч(Параметры.КлючОбъекта) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		ПолноеИмя = "ВнешнийОтчет." + Параметры.КлючОбъекта.ИмяОбъекта;
	Иначе
		ПолноеИмя = Параметры.КлючОбъекта;
	КонецЕсли;

	Контекст.Вставить("ПолноеИмя", ПолноеИмя);
	Контекст.Вставить("Прототип", Параметры.Вариант);
	Контекст.Вставить("КлючПрототипа", Параметры.КлючТекущихНастроек);
	Контекст.Вставить("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Контекст.Вставить("ПолныеПраваНаВарианты", ВариантыОтчетов.ПолныеПраваНаВарианты());
	Контекст.Вставить("ЭтоМобильныйКлиент", ОбщегоНазначения.ЭтоМобильныйКлиент());
	ВариантИнтерфейса = КлиентскоеПриложение.ТекущийВариантИнтерфейса();
	Контекст.Вставить("ВариантИнтерфейса", ВариантИнтерфейса);
	Контекст.Вставить("ЭтоИнтерфейсТакси", ВариантИнтерфейса = ВариантИнтерфейсаКлиентскогоПриложения.Такси);
	Контекст.Вставить("ЭтоПолныеПрава", Пользователи.ЭтоПолноправныйПользователь());
	Контекст.Вставить("ЭтоДополнительныйОтчет", ТипЗнч(Параметры.КлючОбъекта) = Тип(
		"СправочникСсылка.ДополнительныеОтчетыИОбработки"));
	Контекст.Вставить("БезПривязки", Контекст.ЭтоДополнительныйОтчет);
	Контекст.Вставить("ИдентификаторТекущейСтроки");

	ПрочитатьДанныеОтчета();
	Если Не Контекст.РежимНастройки Тогда
		ЗаполнитьСписокВариантов();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСохранение;
		ТекущаяСтраница = 1;
	Иначе
		ВариантСсылка = Контекст.Прототип;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		ТекущаяСтраница = 2;
	КонецЕсли;
	ПрочитатьДанныеВарианта();

	Если Не Параметры.Настройки = Неопределено И Не Параметры.АдресСхемы = Неопределено Тогда
		АдресСхемы = Параметры.АдресСхемы;
		Настройки = Параметры.Настройки;
	ИначеЕсли ЗначениеЗаполнено(Контекст.ПолноеИмя) Тогда
		Если ТипЗнч(Контекст.КлючОбъекта) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			ОтчетОбъект = ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(Контекст.КлючОбъекта);
		Иначе
			ОтчетОбъект = Новый (СтрЗаменить(Контекст.ПолноеИмя, "Отчет.", "ОтчетОбъект."));
		КонецЕсли;
		Если Не ОтчетОбъект = Неопределено Тогда
			МетаданныеОтчета = ОтчетОбъект.Метаданные();
			Если Не МетаданныеОтчета.ОсновнаяСхемаКомпоновкиДанных = Неопределено Тогда
				Схема = ОтчетОбъект.ПолучитьМакет(МетаданныеОтчета.ОсновнаяСхемаКомпоновкиДанных);
				АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
				Если СтрНайти(МетаданныеОтчета.ПолноеИмя(), "ВнешнийОтчет.") > 0 Тогда
					Если Не Параметры.Настройки = Неопределено Тогда
						Настройки = Параметры.Настройки;
					ИначеЕсли Контекст.РежимНастройки И (Контекст.Пользовательский Или Контекст.ЭтоДополнительныйОтчет)
						И ТипЗнч(Контекст.Прототип) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
						Настройки = Контекст.Прототип.Настройки.Получить();
					Иначе
						Настройки = Схема.ВариантыНастроек[Контекст.КлючПрототипа].Настройки;
					КонецЕсли;
				ИначеЕсли Не Контекст.Пользовательский Тогда
					МетаданныеОтчета = ОтчетОбъект.Метаданные();
					Настройки = Схема.ВариантыНастроек[Контекст.КлючПрототипа].Настройки;
				КонецЕсли;
			КонецЕсли;
			Если ТипЗнч(Контекст.Прототип) = Тип("СправочникСсылка.ВариантыОтчетов") И Контекст.Пользовательский Тогда
				Настройки = Контекст.Прототип.Настройки.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Не АдресСхемы = Неопределено Тогда
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
		Если Не Настройки = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;

	ОбновитьПанельКнопокДалееНазад(Элементы, Контекст);

	Если Не Контекст.РежимНастройки Тогда
		ВариантыОтчетаОбработчикАктивизацииСтроки();
	Иначе
		Если Не ЗначениеЗаполнено(ВариантАвтор) И Не ЗначениеЗаполнено(ВариантСсылка) Тогда
			// При сохранении нового варианта автором устанавливается текущий пользователь
			ВариантАвтор = Контекст.ТекущийПользователь;
		КонецЕсли;
		УстановитьДоступностьАвтора(ЭтотОбъект);
		Заголовок = СтрШаблон(НСтр("ru = 'Настройки отчета ""%1""'"), ВариантНаименование);
	КонецЕсли;

	Если Не Контекст.ЭтоВнешний Тогда
		Справочники.ТегиОтчетов.ОбновитьЭлементыТегов(ЭтотОбъект);
		ОбновитьЭлементыПривязок();
	КонецЕсли;

	Если Контекст.ЭтоВнешний Тогда
		КлючСохраненияПоложенияОкна = "ОбщаяФорма.СохранениеВариантаОтчетаУНФ/Внешний";
	ИначеЕсли Контекст.ЭтоДополнительныйОтчет Тогда
		КлючСохраненияПоложенияОкна = "ОбщаяФорма.СохранениеВариантаОтчетаУНФ/Дополнительный";
	Иначе
		КлючСохраненияПоложенияОкна = "ОбщаяФорма.СохранениеВариантаОтчетаУНФ/";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВариантАвтор) Тогда
		КлючСохраненияПоложенияОкна = КлючСохраненияПоложенияОкна + "Предопределенный";
	КонецЕсли;

	РегистрыСведений.НастройкиВариантовОтчетов.ПрочитатьНастройкиДоступностиВариантаОтчета(
		ВариантСсылка, ПользователиВарианта, ИспользоватьГруппыПользователей, ИспользоватьВнешнихПользователей);

	ВариантыОтчетов.ОпределитьПоведениеСпискаПользователейВариантаОтчета(ЭтотОбъект);
	Если Не Контекст.Пользовательский И Контекст.РежимНастройки Тогда
		Элементы.ВариантНаименование.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ВариантНаименование) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Поле ""Наименование"" не заполнено'"), , "Наименование");
		Отказ = Истина;
	ИначеЕсли ВариантыОтчетов.НаименованиеЗанято(Контекст.ОтчетСсылка, ВариантСсылка, ВариантНаименование) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = '""%1"" занято, необходимо указать другое Наименование.'"), ВариантНаименование), ,
			"Наименование");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Не Контекст.РежимНастройки Тогда
		ТекущийЭлемент = Элементы.Наименование;
	КонецЕсли;

	ОформитьПользователейВариантаОтчета(Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОблакоТеговОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	ОблакоТеговОбработкаНавигационнойСсылкиСервер(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаТегаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	ПолеВводаТегаОкончаниеВводаТекстаСервер(Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Контекст.РежимНастройки Тогда
		// Для режима настройки выбор варианта не выполняется
		Возврат;
	КонецЕсли;

	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", ВариантНаименование));
	Если Найденные.Количество() > 0 Тогда
		Элементы.ВариантыОтчета.ТекущаяСтрока = Найденные[0].ПолучитьИдентификатор();
		ВариантыОтчетаОбработчикАктивизацииСтроки();
	Иначе
		ВариантСсылка = Неопределено;
		УстановитьЧтоБудетДальше(ЭтотОбъект, Ложь);
	КонецЕсли;
	УстановитьДоступностьАвтора(ЭтотОбъект);
	ОформитьПользователейВариантаОтчета(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)

	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", Текст));
	УстановитьЧтоБудетДальше(ЭтотОбъект, Найденные.Количество() > 0);

КонецПроцедуры

&НаКлиенте
Процедура ДоступенПриИзменении(Элемент)

	ВариантТолькоДляАвтора = (Доступен = "ТолькоДляАвтора");
	Если ВариантТолькоДляАвтора Тогда
		Для Каждого ЭлементСписка Из ПользователиВарианта Цикл
			ЭлементСписка.Пометка = (ЭлементСписка.Значение = Контекст.ТекущийПользователь);
		КонецЦикла;
	КонецЕсли;
	ОформитьПользователейВариантаОтчета(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаТегаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ПолеВводаТегаОбработкаВыбораСервер(Элемент.Имя, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

#Область ПривязкиПолейОтчетов

&НаКлиенте
Процедура ПривязкаОбъектМетаданныхПриИзменении(Элемент)

	Если Не Контекст.БезПривязки Тогда
		ЗаполнитьСписокВыбораПолейПривязки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалениеПривязкиНажатие(Элемент)

	КомпонентыИмени = СтрРазделить(Элемент.Имя, "_");
	Если КомпонентыИмени.Количество() <> 2 Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторПривязки = Число(КомпонентыИмени[1]);
	СтрокаПривязки = ПривязкиПолей.НайтиПоИдентификатору(ИдентификаторПривязки);
	ПривязкиПолей.Удалить(СтрокаПривязки);

	ОбновитьЭлементыПривязок();

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область Образец

&НаКлиенте
Процедура ВариантОбразецНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьКартинкуЗавершение", ЭтотОбъект);

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Выберите файл изображения'");
	Диалог.ПредварительныйПросмотр = Истина;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = РаботаСФайламиУНФКлиентСервер.ФильтрФайловИзображений();

	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог = Диалог;
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;

	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);

КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура ДоступенДополнительныйОтчетПриИзменении(Элемент)

	ВариантТолькоДляАвтора = (Доступен = "ТолькоДляАвтора");
	Если ВариантТолькоДляАвтора Тогда
		Для Каждого ЭлементСписка Из ПользователиВарианта Цикл
			ЭлементСписка.Пометка = (ЭлементСписка.Значение = Контекст.ТекущийПользователь);
		КонецЦикла;
	КонецЕсли;
	ОформитьПользователейВариантаОтчета(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ВариантНаименованиеПриИзменении(Элемент)

	Если Контекст.РежимНастройки Тогда
		// Для режима настройки выбор варианта не выполняется
		Возврат;
	КонецЕсли;

	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", ВариантНаименование));
	Если Найденные.Количество() > 0 Тогда
		Элементы.ВариантыОтчета.ТекущаяСтрока = Найденные[0].ПолучитьИдентификатор();
		ВариантыОтчетаОбработчикАктивизацииСтроки();
	Иначе
		ВариантСсылка = Неопределено;
		УстановитьЧтоБудетДальше(ЭтотОбъект, Ложь);
	КонецЕсли;
	УстановитьДоступностьАвтора(ЭтотОбъект);
	ОформитьПользователейВариантаОтчета(Ложь);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВариантыОтчета
&НаКлиенте
Процедура ВариантыОтчетаПриАктивизацииСтроки(Элемент)

	Если Контекст.ИдентификаторТекущейСтроки = Элементы.ВариантыОтчета.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	ВариантыОтчетаОбработчикАктивизацииСтроки();

КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Стратегия = НоваяСтратегия();
	Стратегия.ПроверитьСтраницуСохранение = Истина;
	Стратегия.ПроверитьИЗаписать = Истина;
	Стратегия.ЗакрытьПослеЗаписи = Истина;
	ВыполнитьДействия(Неопределено, Стратегия);

КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередУдалением(Элемент, Отказ)

	Отказ = Истина;
	Вариант = Элементы.ВариантыОтчета.ТекущиеДанные;
	Если Вариант = Неопределено Или Не ЗначениеЗаполнено(Вариант.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Если Не Контекст.ПолныеПраваНаВарианты И Не Вариант.АвторТекущийПользователь Тогда
		ТекстПредупреждения = НСтр("ru = 'Недостаточно прав для удаления варианта отчета ""%1"".'");
		ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, Вариант.Наименование);
		ПоказатьПредупреждение( , ТекстПредупреждения);
		Возврат;
	КонецЕсли;

	Если Не Вариант.Пользовательский Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Невозможно удалить предопределенный вариант отчета.'"));
		Возврат;
	КонецЕсли;

	Если Вариант.ПометкаУдаления Тогда
		ТекстВопроса = НСтр("ru = 'Снять с ""%1"" пометку на удаление?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Пометить ""%1"" на удаление?'");
	КонецЕсли;
	ТекстВопроса = СтрШаблон(ТекстВопроса, Вариант.Наименование);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Вариант", Вариант);
	Обработчик = Новый ОписаниеОповещения("ВариантыОтчетаПередУдалениемЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);

КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Отказ = Истина;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиВарианта

&НаКлиенте
Процедура ПользователиВариантаПриИзменении(Элемент)

	ОформитьПользователейВариантаОтчета();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиВариантаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПользователиВариантаПередУдалением(Элемент, Отказ)

	Если Не ИспользоватьГруппыПользователей И Не ИспользоватьВнешнихПользователей Тогда

		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПользователиВариантаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ВариантыОтчетовКлиент.ПользователиВариантаОтчетаОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПользователиВариантаПометкаПриИзменении(Элемент)

	ОформитьПользователейВариантаОтчета();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПодсистем

&НаКлиенте
Процедура ДеревоПодсистемИспользованиеПриИзменении(Элемент)

	ВариантыОтчетовКлиент.ДеревоПодсистемИспользованиеПриИзменении(ЭтотОбъект, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодсистемВажностьПриИзменении(Элемент)

	ВариантыОтчетовКлиент.ДеревоПодсистемВажностьПриИзменении(ЭтотОбъект, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьПользователей(Команда)

	ВариантыОтчетовКлиент.ПодобратьПользователейВариантаОтчета(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьГруппыВнешнихПользователей(Команда)

	ВариантыОтчетовКлиент.ПодобратьПользователейВариантаОтчета(ЭтотОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Если Контекст.РежимНастройки И ТекущаяСтраница = 2 Тогда
		Возврат;
	КонецЕсли;

	Стратегия = НоваяСтратегия();
	Если ТекущаяСтраница = 2 Тогда
		Стратегия.ПроверитьСтраницуНастройки = Истина;
		Стратегия.ПерейтиНаСтраницуСохранение = Истина;
	ИначеЕсли ТекущаяСтраница = 3 Тогда
		Стратегия.ПроверитьСтраницуПодсистемы = Истина;
		Стратегия.ПерейтиНаСтраницуНастройки = Истина;
	ИначеЕсли ТекущаяСтраница = 4 Тогда
		Стратегия.ПроверитьСтраницуТегиОбразец = Истина;
		Стратегия.ПерейтиНаСтраницуПодсистемы = Истина;
	ИначеЕсли ТекущаяСтраница = 5 Тогда
		Стратегия.ПроверитьСтраницуКонтекстноеОткрытие = Истина;
		Стратегия.ПерейтиНаСтраницуТегиОбразец = Истина;
	КонецЕсли;
	ВыполнитьДействия(Неопределено, Стратегия);
	ТекущаяСтраница = ТекущаяСтраница - 1;

КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)

	Если ТекущаяСтраница > 4 Тогда
		Возврат;
	КонецЕсли;

	Стратегия = НоваяСтратегия();
	Если ТекущаяСтраница = 1 Тогда
		Стратегия.ПроверитьСтраницуСохранение = Истина;
		Стратегия.ПерейтиНаСтраницуНастройки = Истина;
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		Стратегия.ПроверитьСтраницуНастройки = Истина;
		Стратегия.ПерейтиНаСтраницуПодсистемы =Истина;
	ИначеЕсли ТекущаяСтраница = 3 Тогда
		Стратегия.ПроверитьСтраницуПодсистемы = Истина;
		Стратегия.ПерейтиНаСтраницуТегиОбразец = Истина;
	ИначеЕсли ТекущаяСтраница = 4 Тогда
		Стратегия.ПроверитьСтраницуТегиОбразец = Истина;
		Стратегия.ПерейтиНаСтраницуКонтекстноеОткрытие = Истина;
	КонецЕсли;
	ВыполнитьДействия(Неопределено, Стратегия);
	ТекущаяСтраница = ТекущаяСтраница + 1;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)

	Стратегия = НоваяСтратегия();
	Если ТекущаяСтраница = 1 Тогда
		Стратегия.ПроверитьСтраницуСохранение = Истина;
	ИначеЕсли ТекущаяСтраница = 2 Тогда
		Стратегия.ПроверитьСтраницуНастройки = Истина;
	ИначеЕсли ТекущаяСтраница = 3 Тогда
		Стратегия.ПроверитьСтраницуПодсистемы = Истина;
	ИначеЕсли ТекущаяСтраница = 4 Тогда
		Стратегия.ПроверитьСтраницуТегиОбразец = Истина;
	ИначеЕсли ТекущаяСтраница = 5 Тогда
		Стратегия.ПроверитьСтраницуКонтекстноеОткрытие = Истина;
	КонецЕсли;
	Стратегия.ПроверитьИЗаписать = Истина;
	ВыполнитьДействия(Неопределено, Стратегия);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПривязку(Команда)

	ДобавитьПривязкуСервер();

КонецПроцедуры

&НаКлиенте
Процедура ПривязкаСохранить(Команда)

	Если Не ЗначениеЗаполнено(ПривязкаОбъектМетаданных) Или (Не ЗначениеЗаполнено(ПривязкаПолеОтчета)
		И Не Контекст.БезПривязки) Тогда
		Возврат;
	КонецЕсли;

	ПривязкаСохранитьСервер();

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПривязкаОтменить(Команда)

	ПривязкаОбъектМетаданных = Неопределено;
	ПривязкаПолеОтчета = Неопределено;
	Элементы.ГруппаДобавлениеПривязки.Видимость = Ложь;
	Элементы.ДобавитьПривязку.Видимость = Истина;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОформитьПользователейВариантаОтчета(СбрасыватьПризнакИспользования = Истина)

	ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента();
	ЦветНеактивныхЗначений = ПараметрыКлиента.ЭлементыСтиля.ТекстЗапрещеннойЯчейкиЦвет;

	Если Не СбрасыватьПризнакИспользования Тогда

		Элементы.ПользователиВарианта.ЦветТекста = ?(ВариантТолькоДляАвтора, ЦветНеактивныхЗначений, Новый Цвет);
		Возврат;

	КонецЕсли;

	КоличествоПомеченных = 0;

	Для Каждого Строка Из ПользователиВарианта Цикл

		Если Строка.Значение = Контекст.ТекущийПользователь Тогда
			Продолжить;
		КонецЕсли;

		КоличествоПомеченных = КоличествоПомеченных + Булево(Строка.Пометка);

	КонецЦикла;

	ВариантТолькоДляАвтора = (КоличествоПомеченных = 0);
	Доступен = ?(ВариантТолькоДляАвтора, "ТолькоДляАвтора", "УказаннымПользователям");

	Элементы.ПользователиВарианта.ЦветТекста = ?(ВариантТолькоДляАвтора, ЦветНеактивныхЗначений, Новый Цвет);

КонецПроцедуры


&НаКлиенте
Процедура ВариантыОтчетаПередУдалениемЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		Вариант = ДополнительныеПараметры.Вариант;
		УдалитьВариантНаСервере(Вариант.Ссылка, Вариант.ИндексКартинки, Вариант.ПометкаУдаления);
		ВариантыОтчетаОбработчикАктивизацииСтроки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКартинкуЗавершение(РазмещенныйФайл, ДополнительныеДанные) Экспорт

	Если РазмещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(ВариантОбразец) И Не ВариантОбразец = ПустаяКартинка Тогда
		УдалитьИзВременногоХранилища(ВариантОбразец);
	КонецЕсли;
	ВариантОбразец = РазмещенныйФайл.Хранение;
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаСервере
Процедура ПолеВводаТегаОбработкаВыбораСервер(ИмяЭлемента, ВыбранноеЗначение, СтандартнаяОбработка)

	Справочники.ТегиОтчетов.ПолеВводаТегаОбработкаВыбора(ЭтотОбъект, ИмяЭлемента, ВыбранноеЗначение,
		СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ПолеВводаТегаОкончаниеВводаТекстаСервер(Текст, ДанныеВыбора, СтандартнаяОбработка)

	Справочники.ТегиОтчетов.ПолеВводаТегаОкончаниеВводаТекста(ЭтотОбъект, Текст, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ОблакоТеговОбработкаНавигационнойСсылкиСервер(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Справочники.ТегиОтчетов.ОблакоТеговОбработкаНавигационнойСсылки(ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ВариантыОтчетов.УстановитьУсловноеОформлениеСпискаПользователейВариантаОтчета(ЭтотОбъект);
	ВариантыОтчетов.УстановитьУсловноеОформлениеДереваПодсистем(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПанельКнопокДалееНазад(Элементы, Контекст)

	Если Контекст.ЭтоВнешний Тогда
		ДоступностьНазад = Ложь;
		ДоступностьДалее = Ложь;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСохранение И Не Контекст.РежимНастройки Тогда
		ДоступностьНазад = Ложь;
		ДоступностьДалее = Истина;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки И Контекст.РежимНастройки Тогда
		// В режиме настройки не требуется список отчетов
		ДоступностьНазад = Ложь;
		ДоступностьДалее = Истина;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКонтекстноеОткрытие Тогда
		ДоступностьНазад = Истина;
		ДоступностьДалее = Ложь;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбразецТеги И Контекст.БезПривязки Тогда
		// Для дополнительных отчетов недоступно контекстное открытие
		ДоступностьНазад = Истина;
		ДоступностьДалее = Ложь;
	Иначе
		ДоступностьНазад = Истина;
		ДоступностьДалее = Истина;
	КонецЕсли;
	Если Элементы.Назад.Доступность <> ДоступностьНазад Тогда
		Элементы.Назад.Доступность = ДоступностьНазад;
	КонецЕсли;
	Если Элементы.Далее.Доступность <> ДоступностьДалее Тогда
		Элементы.Далее.Доступность = ДоступностьДалее;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеОтчета()

	Если Контекст.ЭтоДополнительныйОтчет Тогда
		ОтчетИнформация = СформироватьИнформациюОбОбДополнительномОтчете(Контекст.КлючОбъекта);
		Контекст.Вставить("ВидОтчета", ОтчетИнформация.Вид);
		// Для дополнительных отчетов используется контекстная привязка БСП, нет возможности указать поле отчета
		Элементы.ПривязкаПолеОтчета.Видимость = Не Контекст.БезПривязки;
		Элементы.ДобавитьПривязку.Видимость = Не Контекст.БезПривязки;
		Элементы.ДекорацияПривязка.Видимость = Не Контекст.БезПривязки;
	Иначе
		ОтчетИнформация = ВариантыОтчетов.ИнформацияОбОтчете(Контекст.ПолноеИмя);
	КонецЕсли;

	Контекст.Вставить("ОтчетСсылка", ОтчетИнформация.Отчет);
	Контекст.Вставить("ОтчетИмя", ОтчетИнформация.ОтчетИмя);
	Контекст.Вставить("ТипОтчета", ОтчетИнформация.ТипОтчета);
	Контекст.Вставить("ЭтоВнешний", ОтчетИнформация.ТипОтчета = Перечисления.ТипыОтчетов.Внешний);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЧтоБудетДальше(Форма, Перезапись)

	Если Перезапись Тогда
		Форма.Элементы.ПерезаписьНовый.ТекущаяСтраница = Форма.Элементы.Перезапись;
	Иначе
		Форма.Элементы.ПерезаписьНовый.ТекущаяСтраница = Форма.Элементы.Новый;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьАвтора(Форма)

	Элементы = Форма.Элементы;

	АвторЗаполнен = ЗначениеЗаполнено(Форма.ВариантАвтор);
	Элементы.ВариантАвтор.Видимость = АвторЗаполнен;
	Элементы.СтраницыДоступен.Видимость = АвторЗаполнен;
	Если Форма.Контекст.ЭтоДополнительныйОтчет Тогда
		Элементы.СтраницыДоступен.ТекущаяСтраница = Элементы.СтраницаДополнительныйОтчет;
		Элементы.ДоступенДополнительныйОтчет.ТолькоПросмотр = Не Форма.Контекст.ПолныеПраваНаВарианты;
	Иначе
		Элементы.СтраницыДоступен.ТекущаяСтраница = Элементы.СтраницаОсновнойОтчет;
		Элементы.Доступен.ТолькоПросмотр = Не Форма.Контекст.ПолныеПраваНаВарианты;
		Элементы.ПользователиВарианта.ТолькоПросмотр = Не Форма.Контекст.ПолныеПраваНаВарианты;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьИнформациюОбОбДополнительномОтчете(Отчет)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Отчет);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеОтчетыИОбработки.Ссылка КАК Отчет,
	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта КАК ОтчетИмя,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОтчетов.Дополнительный) КАК ТипОтчета,
	|	ДополнительныеОтчетыИОбработки.Вид КАК Вид
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура;
	Результат.Вставить("Отчет");
	Результат.Вставить("ОтчетИмя");
	Результат.Вставить("ТипОтчета");
	Результат.Вставить("Вид");

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВариантов()

	ТекущийКлючВарианта = Контекст.КлючПрототипа;
	Если ЗначениеЗаполнено(Элементы.ВариантыОтчета.ТекущаяСтрока) Тогда
		ТекущаяСтрока = ВариантыОтчета.НайтиПоИдентификатору(Элементы.ВариантыОтчета.ТекущаяСтрока);
		Если ЗначениеЗаполнено(ТекущаяСтрока.КлючВарианта) Тогда
			ТекущийКлючВарианта = ТекущаяСтрока.КлючВарианта;
		КонецЕсли;
	КонецЕсли;

	ВариантыОтчета.Очистить();

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетов.Ссылка КАК Ссылка,
	|	ВариантыОтчетов.Пользовательский КАК Пользовательский,
	|	ВариантыОтчетов.Наименование КАК Наименование,
	|	ВариантыОтчетов.Автор КАК Автор,
	|	ВариантыОтчетов.Описание КАК Описание,
	|	ВариантыОтчетов.ТипОтчета КАК Тип,
	|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	|	ВариантыОтчетов.ТолькоДляАвтора КАК ТолькоДляАвтора,
	|	ВариантыОтчетов.ВидимостьПоУмолчанию КАК ВидимостьПоУмолчанию,
	|	ВариантыОтчетов.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Автор = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АвторТекущийПользователь,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА ВариантыОтчетов.Пользовательский
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ПометкаУдаления
	|			ТОГДА 3
	|		КОГДА ВариантыОтчетов.Пользовательский
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И (ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	|			ИЛИ ВариантыОтчетов.Пользовательский = ИСТИНА)
	|	И (ВариантыОтчетов.КлючВарианта = &ТекущийКлючВарианта
	|			ИЛИ ВариантыОтчетов.ТолькоДляАвтора
	|				И ВариантыОтчетов.Автор = &ТекущийПользователь
	|			ИЛИ ВариантыОтчетов.Автор В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка))
	|			ИЛИ ВариантыОтчетов.Ссылка В
	|				(ВЫБРАТЬ
	|					НастройкиВариантовОтчетов.Вариант
	|				ИЗ
	|					РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиВариантовОтчетов
	|				ГДЕ
	|					НастройкиВариантовОтчетов.Пользователь = &ТекущийПользователь
	|					И НастройкиВариантовОтчетов.Подсистема В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовМетаданных.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ИдентификаторыОбъектовРасширений.ПустаяСсылка))
	|					И НастройкиВариантовОтчетов.Видимость))
	|	И НЕ ВариантыОтчетов.ПредопределенныйВариант В (&ОтключенныеВариантыПрограммы)";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отчет", Контекст.ОтчетСсылка);
	Запрос.УстановитьПараметр("ТекущийКлючВарианта", ТекущийКлючВарианта);
	Запрос.УстановитьПараметр("ТекущийПользователь", Контекст.ТекущийПользователь);
	Запрос.УстановитьПараметр("ОтключенныеВариантыПрограммы", ВариантыОтчетовПовтИсп.ОтключенныеВариантыПрограммы());

	Запрос.Текст = ТекстЗапроса;

	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();

	ВариантыОтчета.Загрузить(ТаблицаЗначений);
	
	// Добавить предопределенные варианты внешнего отчета.
	Если Контекст.ЭтоВнешний Тогда
		Попытка
			// АПК:553-выкл Создание в области данных дополнительных отчетов, одобренных администратором сервиса.
			ОтчетОбъект = ВнешниеОтчеты.Создать(Контекст.ОтчетИмя);
			// АПК:553-вкл
		Исключение
			ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось получить список предопределенных вариантов
				 |внешнего отчета ""%1"":
				 |%2'"), Контекст.ОтчетСсылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			ЗаписьЖурналаРегистрации(
			"СохранениеВариантаОтчетаУНФ", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ИдентификаторыОбъектовМетаданных, Контекст.ОтчетСсылка, ТекстОшибки);
			Возврат;
		КонецПопытки;

		Если ОтчетОбъект.СхемаКомпоновкиДанных = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Для Каждого ВариантНастроекКД Из ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
			Вариант = ВариантыОтчета.Добавить();
			Вариант.Пользовательский = Ложь;
			Вариант.Наименование = ВариантНастроекКД.Представление;
			Вариант.КлючВарианта = ВариантНастроекКД.Имя;
			Вариант.ТолькоДляАвтора = Ложь;
			Вариант.АвторТекущийПользователь = Ложь;
			Вариант.ИндексКартинки = 5;
		КонецЦикла;
	КонецЕсли;

	ВариантыОтчета.Сортировать("Наименование Возр");

	Контекст.ИдентификаторТекущейСтроки = -1;
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("КлючВарианта", ТекущийКлючВарианта));
	Если Найденные.Количество() > 0 Тогда
		Вариант = Найденные[0];
		ВариантСсылка = Вариант.Ссылка;
		Контекст.ИдентификаторТекущейСтроки = Вариант.ПолучитьИдентификатор();
		Элементы.ВариантыОтчета.ТекущаяСтрока = Контекст.ИдентификаторТекущейСтроки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВариантыОтчетаОбработчикАктивизацииСтроки()

	Если Контекст.РежимНастройки Тогда
		Возврат;
	КонецЕсли;
	Контекст.ИдентификаторТекущейСтроки = Элементы.ВариантыОтчета.ТекущаяСтрока;
	Если Контекст.ИдентификаторТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Вариант = ВариантыОтчета.НайтиПоИдентификатору(Контекст.ИдентификаторТекущейСтроки);
	Если Вариант = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПравоНастройкиВарианта = ПравоНастройкиВарианта(Вариант, Контекст.ПолныеПраваНаВарианты);
	ПравоЗаписиВарианта    = ПравоЗаписиВарианта(Вариант, ПравоНастройкиВарианта, Контекст.ЭтоПолныеПрава,
		Контекст.РежимНастройки);
	Если ПравоЗаписиВарианта Тогда
		ВариантСсылка = Вариант.Ссылка;
		ПрочитатьДанныеВарианта();
	Иначе
		ВариантСсылка = Неопределено;
		ВариантАвтор = Контекст.ТекущийПользователь;
		ВариантНаименование = СформироватьСвободноеНаименование(Вариант, ВариантыОтчета);
		ВариантОписание = "";
		ВариантТолькоДляАвтора = Истина;
		Доступен = "ТолькоДляАвтора";
	КонецЕсли;
	УстановитьЧтоБудетДальше(ЭтотОбъект, ЗначениеЗаполнено(ВариантСсылка));
	УстановитьДоступностьАвтора(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСвободноеНаименование(Вариант, ВариантыОтчета)

	ШаблонИмениВарианта = СтрШаблон(НСтр("ru = '%1 - копия'"), СокрЛП(Вариант.Наименование));

	СвободноеНаименование = ШаблонИмениВарианта;
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
	Если Найденные.Количество() = 0 Тогда
		Возврат СвободноеНаименование;
	КонецЕсли;

	НомерВарианта = 1;
	Пока Истина Цикл
		НомерВарианта = НомерВарианта + 1;
		СвободноеНаименование = ШаблонИмениВарианта + " (" + Формат(НомерВарианта, "") + ")";
		Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
		Если Найденные.Количество() = 0 Тогда
			Возврат СвободноеНаименование;
		КонецЕсли;
	КонецЦикла;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПравоНастройкиВарианта(Вариант, ПолныеПраваНаВарианты)
	Возврат (ПолныеПраваНаВарианты Или Вариант.АвторТекущийПользователь) И ЗначениеЗаполнено(Вариант.Ссылка);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПравоЗаписиВарианта(Вариант, ПравоНастройкиВарианта, ЭтоПолныеПрава, РежимНастройки)
	Возврат (Вариант.Пользовательский Или (РежимНастройки И ЭтоПолныеПрава)) И ПравоНастройкиВарианта;
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеВарианта()

	Запрос = Новый Запрос;
	Если ТипЗнч(ВариантСсылка) = Тип("СправочникСсылка.ВариантыДополнительныхОтчетов") Тогда
		Запрос.УстановитьПараметр("Ссылка", ВариантСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыДополнительныхОтчетов.Ссылка,
		|	ВариантыДополнительныхОтчетов.Наименование,
		|	ВариантыДополнительныхОтчетов.Автор,
		|	ВариантыДополнительныхОтчетов.ТолькоДляАвтора КАК ТолькоДляАвтора,
		|	ИСТИНА КАК Пользовательский,
		|	ВариантыДополнительныхОтчетов.Описание,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.ФункциональнаяОпция, """") КАК ФункциональнаяОпция,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Образец, НЕОПРЕДЕЛЕНО) КАК Образец,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Теги, """") КАК Теги,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Рекомендуемый, ЛОЖЬ) КАК Рекомендуемый
		|ИЗ
		|	Справочник.ВариантыДополнительныхОтчетов КАК ВариантыДополнительныхОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетовУНФ КАК НастройкиВариантовОтчетовУНФ
		|		ПО ВариантыДополнительныхОтчетов.Ссылка = НастройкиВариантовОтчетовУНФ.Вариант
		|ГДЕ
		|	ВариантыДополнительныхОтчетов.Ссылка = &Ссылка";
	ИначеЕсли ТипЗнч(ВариантСсылка) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		Запрос.УстановитьПараметр("Ссылка", ВариантСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыОтчетов.Ссылка,
		|	ВариантыОтчетов.Наименование,
		|	ВариантыОтчетов.Автор,
		|	ВариантыОтчетов.ТолькоДляАвтора,
		|	ВариантыОтчетов.Пользовательский,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(ВариантыОтчетов.Описание, 1, 1) = """"
		|				И НЕ ВариантыОтчетов.ПредопределенныйВариант = НЕОПРЕДЕЛЕНО
		|			ТОГДА ВариантыОтчетов.ПредопределенныйВариант.Описание
		|		ИНАЧЕ ВариантыОтчетов.Описание
		|	КОНЕЦ КАК Описание,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.ФункциональнаяОпция, """") КАК ФункциональнаяОпция,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Образец, НЕОПРЕДЕЛЕНО) КАК Образец,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Теги, """") КАК Теги,
		|	ЕСТЬNULL(НастройкиВариантовОтчетовУНФ.Рекомендуемый, ЛОЖЬ) КАК Рекомендуемый
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетовУНФ КАК НастройкиВариантовОтчетовУНФ
		|		ПО ВариантыОтчетов.Ссылка = НастройкиВариантовОтчетовУНФ.Вариант
		|ГДЕ
		|	ВариантыОтчетов.Ссылка = &Ссылка";
	Иначе
		Возврат;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВариантАвтор           = Выборка.Автор;
		ВариантНаименование    = Выборка.Наименование;
		ВариантОписание        = Выборка.Описание;
		ВариантТолькоДляАвтора = Выборка.ТолькоДляАвтора;
		Доступен = ?(ВариантТолькоДляАвтора, "ТолькоДляАвтора", "УказаннымПользователям");
		ВариантФункциональнаяОпция = Выборка.ФункциональнаяОпция;
		ВариантТеги            = Выборка.Теги;
		ВариантРекомендуемый   = Выборка.Рекомендуемый;
		Контекст.Вставить("Пользовательский", Выборка.Пользовательский);
		Если Контекст.РежимНастройки И ТипЗнч(Выборка.Образец) = Тип("ХранилищеЗначения") Тогда
			Образец = Выборка.Образец.Получить();
			Если ТипЗнч(Образец) = Тип("Картинка") Тогда
				ВариантОбразец = ПоместитьВоВременноеХранилище(Образец, УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		Справочники.ТегиОтчетов.ОбновитьТаблицуТегов(ЭтотОбъект);
		ЗаполнитьТегиОтчета();
		УстановитьДоступностьАвтора(ЭтотОбъект);
	Иначе
		Контекст.Вставить("Пользовательский", Ложь);
	КонецЕсли;

	ПрочитатьДанныеПривязок();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТегиОтчета()
	ТегиОтчета.Очистить();
	ТегиВВидеСтрок = СтрРазделить(ВариантТеги, ",", Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТегиОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТегиОтчетов КАК ТегиОтчетов
	|ГДЕ
	|	ТегиОтчетов.Наименование В(&ТегиВВидеСтрок)";
	Запрос.УстановитьПараметр("ТегиВВидеСтрок", ТегиВВидеСтрок);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТегиОтчета.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ВыполнитьДействия(Результат, Стратегия) Экспорт

	Стратегия.ВариантЭтоНовый = Не ЗначениеЗаполнено(ВариантСсылка);
	
	// Обработка результата предыдущего шага.
	Если Стратегия.ОтобразитьЗапросНаПерезапись Тогда
		Стратегия.ОтобразитьЗапросНаПерезапись = Ложь;
		Если Результат = КодВозвратаДиалога.Да Тогда
			Стратегия.ВопросНаПерезаписьПройден = Истина;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка заполнения страниц 

	Если Стратегия.ПроверитьСтраницуСохранение Тогда
		
		// Наименование не введено.
		Если Не ЗначениеЗаполнено(ВариантНаименование) Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Наименование"" не заполнено'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ВариантНаименование");
			Возврат;
		КонецЕсли;
		
		// Введено наименование существующего варианта отчета.
		Если Не Стратегия.ВариантЭтоНовый Тогда
			Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Ссылка", ВариантСсылка));
			Вариант = Найденные[0];
			Если Не ПравоЗаписиВарианта(Вариант, ПравоНастройкиВарианта(Вариант, Контекст.ПолныеПраваНаВарианты),
				Контекст.ЭтоПолныеПрава, Контекст.РежимНастройки) Тогда
				ТекстОшибки = НСтр(
					"ru = 'Недостаточно прав для изменения варианта ""%1"". Необходимо выбрать другой вариант или изменить Наименование.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ВариантНаименование);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ВариантНаименование");
				Возврат;
			КонецЕсли;
			Если Не Стратегия.ВопросНаПерезаписьПройден Тогда
				Если Вариант.ПометкаУдаления = Истина Тогда
					ТекстВопроса = НСтр("ru = 'Вариант отчета ""%1"" помечен на удаление.
										|Заменить помеченный на удаление вариант отчета?'");
					КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
				Иначе
					ТекстВопроса = НСтр("ru = 'Заменить ранее сохраненный вариант отчета ""%1""?'");
					КнопкаПоУмолчанию = КодВозвратаДиалога.Да;
				КонецЕсли;
				ТекстВопроса = СтрШаблон(ТекстВопроса, ВариантНаименование);
				Стратегия.ОтобразитьЗапросНаПерезапись = Истина;
				Обработчик = Новый ОписаниеОповещения("ВыполнитьДействия", ЭтотОбъект, Стратегия);
				ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КнопкаПоУмолчанию);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		// Проверка завершена.
		Стратегия.ПроверитьСтраницуСохранение = Ложь;

	КонецЕсли;

	Если Стратегия.ПроверитьСтраницуНастройки Тогда
		
		// Наименование не введено.
		Если Не ЗначениеЗаполнено(ВариантНаименование) Тогда
			ТекстОшибки = НСтр("ru = 'Поле ""Наименование"" не заполнено'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ВариантНаименование");
			Возврат;
		КонецЕсли;
		
		// Проверка завершена.
		Стратегия.ПроверитьСтраницуНастройки = Ложь;

	КонецЕсли;

	Если Стратегия.ПроверитьСтраницуПодсистемы Тогда
		
		// Проверка завершена.
		Стратегия.ПроверитьСтраницуПодсистемы = Ложь;

	КонецЕсли;

	Если Стратегия.ПроверитьСтраницуТегиОбразец Тогда
		
		// Проверка завершена.
		Стратегия.ПроверитьСтраницуТегиОбразец = Ложь;

	КонецЕсли;

	Если Стратегия.ПроверитьСтраницуКонтекстноеОткрытие Тогда

		Если Не Элементы.ДобавитьПривязку.Видимость Тогда
			ТекстОшибки = НСтр("ru = 'Отмените или завершите редактирование описания контекстного открытия отчета'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ДобавитьПривязку");
			Возврат;
		КонецЕсли; 
		
		// Проверка завершена.
		Стратегия.ПроверитьСтраницуКонтекстноеОткрытие = Ложь;

	КонецЕсли;
	
	// Переключение страниц

	Если Стратегия.ПерейтиНаСтраницуСохранение Тогда
		// Для режима настройки список отчетов недоступен.
		Если Не Контекст.РежимНастройки Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСохранение;
		КонецЕсли;
		Стратегия.ПерейтиНаСтраницуСохранение = Ложь;
	КонецЕсли;

	Если Стратегия.ПерейтиНаСтраницуНастройки Тогда
		// Для внешних отчетов настройки недоступны.
		Если Не Контекст.ЭтоВнешний Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		КонецЕсли;
		Стратегия.ПерейтиНаСтраницуНастройки = Ложь;
	КонецЕсли;

	Если Стратегия.ПерейтиНаСтраницуПодсистемы Тогда
		// Для внешних отчетов настройки недоступны.
		Если Не Контекст.ЭтоВнешний Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодсистемы;
			ПерезаполнитьДеревоПодсистем();
			СтрокиДерева = ДеревоПодсистем.ПолучитьЭлементы();
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Элементы.ДеревоПодсистем.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
			КонецЦикла;
		КонецЕсли;
		Стратегия.ПерейтиНаСтраницуПодсистемы = Ложь;
	КонецЕсли;

	Если Стратегия.ПерейтиНаСтраницуТегиОбразец Тогда
		// Для внешних отчетов настройки недоступны.
		Если Не Контекст.ЭтоВнешний Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбразецТеги;
		КонецЕсли;
		Стратегия.ПерейтиНаСтраницуТегиОбразец = Ложь;
	КонецЕсли;

	Если Стратегия.ПерейтиНаСтраницуКонтекстноеОткрытие Тогда
		// Для внешних отчетов настройки недоступны.
		Если Не Контекст.ЭтоВнешний Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКонтекстноеОткрытие;
		КонецЕсли;
		Стратегия.ПерейтиНаСтраницуКонтекстноеОткрытие = Ложь;
	КонецЕсли;

	ОбновитьПанельКнопокДалееНазад(Элементы, Контекст);

	// Сохранение изменений
	Если Стратегия.ПроверитьИЗаписать Тогда
		Если Не Стратегия.ВариантЭтоНовый И Не Контекст.ЭтоПолныеПрава И Контекст.ПолныеПраваНаВарианты И Не ВариантАвтор
			= Контекст.ТекущийПользователь Тогда
			ТекстОшибки = НСтр("ru = 'Недостаточно прав для изменения варианта ""%1"".'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ВариантНаименование);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ВариантНаименование");
			Возврат;
		КонецЕсли;
		Стратегия.Вставить("Отказ", Ложь);
		ПроверитьИЗаписатьНаСервере(Стратегия);
		Если Стратегия.Отказ = Истина Тогда
			Возврат;
		КонецЕсли;
		СохранитьНастройкиВарианта();
		ОповеститьОВыборе(ВариантСсылка);
		Стратегия.ПроверитьИЗаписать = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция НоваяСтратегия()

	Результат = Новый Структура;
	Результат.Вставить("ВариантЭтоНовый", Ложь);
	Результат.Вставить("ОтобразитьЗапросНаПерезапись", Ложь);
	Результат.Вставить("ВопросНаПерезаписьПройден", Ложь);
	Результат.Вставить("ПроверитьСтраницуСохранение", Ложь);
	Результат.Вставить("ПроверитьСтраницуНастройки", Ложь);
	Результат.Вставить("ПроверитьСтраницуПодсистемы", Ложь);
	Результат.Вставить("ПроверитьСтраницуТегиОбразец", Ложь);
	Результат.Вставить("ПроверитьСтраницуКонтекстноеОткрытие", Ложь);
	Результат.Вставить("ПерейтиНаСтраницуСохранение", Ложь);
	Результат.Вставить("ПерейтиНаСтраницуНастройки", Ложь);
	Результат.Вставить("ПерейтиНаСтраницуПодсистемы", Ложь);
	Результат.Вставить("ПерейтиНаСтраницуТегиОбразец", Ложь);
	Результат.Вставить("ПерейтиНаСтраницуКонтекстноеОткрытие", Ложь);
	Результат.Вставить("ПроверитьИЗаписать", Ложь);
	Результат.Вставить("ЗакрытьПослеЗаписи", Ложь);
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПерезаполнитьДеревоПодсистем()

	Если Не ЗначениеЗаполнено(ВариантСсылка) Тогда
		ВариантОснование = Контекст.Прототип;
	Иначе
		ВариантОснование = ВариантСсылка;
	КонецЕсли;
	ДеревоПриемник = ВариантыОтчетов.ДеревоПодсистемСформировать(ЭтотОбъект, ВариантОснование);
	ЗначениеВРеквизитФормы(ДеревоПриемник, "ДеревоПодсистем");

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВарианта()
	
	// Настройки СКД
	Если Не Контекст.РежимНастройки Тогда
		ХранилищаНастроек.ХранилищеВариантовОтчетов.Сохранить(Контекст.ПолноеИмя, ВариантКлючВарианта,
			КомпоновщикНастроек.Настройки);
	КонецЕсли; 
	
	// Теги
	ВариантТеги = СтрСоединить(ТегиОтчета.ВыгрузитьЗначения(), ",");
	
	// Настройки вариантов УНФ
	Менеджер = РегистрыСведений.НастройкиВариантовОтчетовУНФ.СоздатьМенеджерЗаписи();
	Менеджер.Вариант = ВариантСсылка;

	Если ЭтоАдресВременногоХранилища(ВариантОбразец) И Не ВариантОбразец = ПустаяКартинка Тогда
		ДанныеВариантОбразец = ПолучитьИзВременногоХранилища(ВариантОбразец);
		Если ТипЗнч(ДанныеВариантОбразец) = Тип("Картинка") Тогда
			Менеджер.Образец = Новый ХранилищеЗначения(ДанныеВариантОбразец);
		ИначеЕсли ТипЗнч(ДанныеВариантОбразец) = Тип("ДвоичныеДанные") Тогда
			Менеджер.Образец = Новый ХранилищеЗначения(Новый Картинка(ДанныеВариантОбразец));
		КонецЕсли;
	Иначе
		Менеджер.Образец = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;

	Менеджер.ФункциональнаяОпция = ВариантФункциональнаяОпция;
	Менеджер.Теги = ВариантТеги;
	Менеджер.Рекомендуемый = ВариантРекомендуемый;
	Менеджер.ИзмененаПользователем = Истина;
	Менеджер.Записать(Истина);
	
	// Привязка полей отчетов
	Набор = РегистрыСведений.ПривязкаПолейОтчетовУНФ.СоздатьНаборЗаписей();
	Набор.Отбор.Вариант.Установить(ВариантСсылка);
	Для Каждого Стр Из ПривязкиПолей Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.Вариант = ВариантСсылка;
		Запись.ИзмененаПользователем = Истина;
		Запись.Использовать = Истина;
	КонецЦикла;
	Набор.Записать(Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВариантНаСервере(Ссылка, ИндексКартинки, ПометкаУдаления)
	ВариантОбъект = Ссылка.ПолучитьОбъект();
	ВариантОбъект.УстановитьПометкуУдаления(Не ВариантОбъект.ПометкаУдаления);
	ПометкаУдаления = ВариантОбъект.ПометкаУдаления;
	ИндексКартинки = ?(ПометкаУдаления, 4, ?(ВариантОбъект.Пользовательский, 3, 5));
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьНаСервере(Пакет)

	ВариантЭтоНовый = Не ЗначениеЗаполнено(ВариантСсылка);

	Если ВариантЭтоНовый И ВариантыОтчетов.НаименованиеЗанято(Контекст.ОтчетСсылка, ?(ВариантСсылка = Неопределено,
		Справочники.ВариантыОтчетов.ПустаяСсылка(), ВариантСсылка), ВариантНаименование) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = '""%1"" занято, необходимо указать другое Наименование.'"),
			ВариантНаименование);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ВариантНаименование");
		Пакет.Отказ = Истина;
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка
		Если ВариантЭтоНовый Тогда
			ВариантОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
			ВариантОбъект.Отчет            = Контекст.ОтчетСсылка;
			ВариантОбъект.ТипОтчета        = Контекст.ТипОтчета;
			ВариантОбъект.КлючВарианта     = Строка(Новый УникальныйИдентификатор);
			ВариантОбъект.Пользовательский = Истина;
			ВариантОбъект.Автор            = Контекст.ТекущийПользователь;
			ВариантОбъект.ЗаполнитьРодителя();
		Иначе
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ВариантыОтчетов.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВариантСсылка);
			Блокировка.Заблокировать();
			ВариантОбъект = ВариантСсылка.ПолучитьОбъект();
		КонецЕсли;
		ВариантОбъект.Наименование = ВариантНаименование;
		ВариантОбъект.Описание     = ВариантОписание;
		ВариантОбъект.ТолькоДляАвтора      = ВариантТолькоДляАвтора;
		
		// Подсистемы варианта
		ДеревоПриемник = РеквизитФормыВЗначение("ДеревоПодсистем", Тип("ДеревоЗначений"));
		Если ВариантЭтоНовый Тогда
			ИзмененныеРазделы = ДеревоПриемник.Строки.НайтиСтроки(Новый Структура("Использование", 1), Истина);
		Иначе
			ИзмененныеРазделы = ДеревоПриемник.Строки.НайтиСтроки(Новый Структура("Модифицированность", Истина), Истина);
		КонецЕсли;
		ВариантыОтчетов.ДеревоПодсистемЗаписать(ВариантОбъект, ИзмененныеРазделы);

		ВариантОбъект.Записать();

		ВариантСсылка = ВариантОбъект.Ссылка;
		Если ТипЗнч(ВариантСсылка) = Тип("СправочникСсылка.ВариантыОтчетов") Тогда
			ВариантКлючВарианта = ВариантОбъект.КлючВарианта;
		Иначе
			ВариантКлючВарианта = ВариантОбъект.ИдентификаторКоманды;
		КонецЕсли;
		РегистрыСведений.НастройкиВариантовОтчетов.ЗаписатьНастройкиДоступностиВариантаОтчета(
			ВариантСсылка, ВариантЭтоНовый, ПользователиВарианта);

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ПривязкиПолейОтчетов

&НаСервере
Процедура ПрочитатьДанныеПривязок()

	Запрос = Новый Запрос;
	Если Не ЗначениеЗаполнено(ВариантСсылка) Тогда
		Запрос.УстановитьПараметр("Вариант", Контекст.Прототип);
	Иначе
		Запрос.УстановитьПараметр("Вариант", ВариантСсылка);
	КонецЕсли;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПривязкаПолейОтчетовУНФ.Поле,
	|	ПривязкаПолейОтчетовУНФ.Объект,
	|	ПривязкаПолейОтчетовУНФ.СложныйАлгоритм,
	|	ПривязкаПолейОтчетовУНФ.ДополнительныйРазрез,
	|	ПривязкаПолейОтчетовУНФ.Объект.Синоним КАК Представление
	|ИЗ
	|	РегистрСведений.ПривязкаПолейОтчетовУНФ КАК ПривязкаПолейОтчетовУНФ
	|ГДЕ
	|	ПривязкаПолейОтчетовУНФ.Вариант = &Вариант";
	ПривязкиПолей.Загрузить(Запрос.Выполнить().Выгрузить());

	Для Каждого Стр Из ПривязкиПолей Цикл
		Стр.Представление = ПредставлениеПривязки(Стр.ПолучитьИдентификатор(), Стр.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПредставлениеПривязки(Идентификатор, Синоним = "")

	Стр = ПривязкиПолей.НайтиПоИдентификатору(Идентификатор);
	Если ПустаяСтрока(Синоним) Тогда
		Синоним = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Объект, "Синоним");
	КонецЕсли;
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Стр.Объект);
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Представление = СтрШаблон(НСтр("ru = 'Из справочника %1'"), Синоним);
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Представление = СтрШаблон(НСтр("ru = 'Из документа %1'"), Синоним);
	Иначе
		Представление = СтрШаблон(НСтр("ru = 'Из %1'"), Синоним);
	КонецЕсли;
	Возврат ПредставлениеОтметки(Представление);

КонецФункции

&НаСервере
Процедура ОбновитьЭлементыПривязок()

	УдалитьЭлементы(Элементы.ГруппаПривязанныеПоляЭлементы);

	Если ОтключитьВидимостьГруппыПривязанныхПолей() Тогда
		Элементы.ГруппаПривязанныеПоля.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаПривязкаПолей Из ПривязкиПолей Цикл
		ДобавитьЭлементыПривязки(СтрокаПривязкаПолей);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыПривязки(СтрокаПривязкаПолей)
	ИдентификаторПривязки = СтрокаПривязкаПолей.ПолучитьИдентификатор();
	ИмяГруппыПривязки = ИмяЭлемента("ГруппаПривязки_%1", ИдентификаторПривязки);
	ГруппаПривязки = Элементы.Добавить(ИмяГруппыПривязки, Тип("ГруппаФормы"), Элементы.ГруппаПривязанныеПоляЭлементы);
	ГруппаПривязки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПривязки.ОтображатьЗаголовок = Ложь;
	ГруппаПривязки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПривязки.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	ИмяЭлементаЗаголовокПривязки = ИмяЭлемента("ЗаголовокПривязки_%1", ИдентификаторПривязки);
	ЗаголовокПривязки = Элементы.Добавить(ИмяЭлементаЗаголовокПривязки, Тип("ДекорацияФормы"), ГруппаПривязки);
	ЗаголовокПривязки.Вид = ВидДекорацииФормы.Надпись;
	ЗаголовокПривязки.Заголовок = СтрокаПривязкаПолей.Представление;
	ЗаголовокПривязки.АвтоМаксимальнаяШирина = Ложь;
	ЗаголовокПривязки.МаксимальнаяШирина = 0;
	ИмяЭлементаУдалениеПривязки = ИмяЭлемента("УдалениеПривязки_%1", ИдентификаторПривязки);
	УдалениеПривязки = Элементы.Добавить(ИмяЭлементаУдалениеПривязки, Тип("ДекорацияФормы"), ГруппаПривязки);
	УдалениеПривязки.Вид = ВидДекорацииФормы.Картинка;
	УдалениеПривязки.Картинка = БиблиотекаКартинок.Закрыть;
	УдалениеПривязки.Гиперссылка = Истина;
	УдалениеПривязки.УстановитьДействие("Нажатие", "Подключаемый_УдалениеПривязкиНажатие");
КонецПроцедуры

&НаСервере
Функция ИмяЭлемента(ПрефиксЭлемента, Индекс)
	Результат = СтрШаблон(ПрефиксЭлемента, Формат(Индекс, "ЧН=0; ЧГ=;"));
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОтключитьВидимостьГруппыПривязанныхПолей()

	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы Цикл

		Если ТипЗнч(Элемент) <> Тип("ДоступноеПолеОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого Тип Из Элемент.ТипЗначения.Типы() Цикл

			Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
				Продолжить;
			КонецЕсли;

			Если Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
				Продолжить;
			КонецЕсли;

			Возврат Ложь;

		КонецЦикла;

	КонецЦикла;

	Возврат Истина;

КонецФункции

&НаСервере
Процедура УдалитьЭлементы(Группа)

	УдаляемыеЭлементы = Новый Массив;
	Для Каждого СтрокаТегов Из Группа.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(СтрокаТегов);
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьПривязкуСервер()

	ЗаполнитьСписокВыбораОбъектовПривязки();
	Если Элементы.ПривязкаОбъектМетаданных.СписокВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПривязкаОбъектМетаданных = Элементы.ПривязкаОбъектМетаданных.СписокВыбора[0].Значение;
	ЗаполнитьСписокВыбораПолейПривязки();
	Элементы.ГруппаДобавлениеПривязки.Видимость = Истина;
	Элементы.ДобавитьПривязку.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбъектовПривязки()

	Если Не НастройкиФормы.Свойство("ПоляИИдентификаторы") Тогда
		НастройкиФормы.Вставить("ПоляИИдентификаторы", Новый Массив);
		ОбновитьСписокПолей = Истина;
	Иначе
		ОбновитьСписокПолей = Ложь;
	КонецЕсли;
	Элементы.ПривязкаОбъектМетаданных.СписокВыбора.Очистить();
	ДоступныеПоля = КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора;
	Для Каждого Элемент Из ДоступныеПоля.Элементы Цикл
		Если ТипЗнч(Элемент) <> Тип("ДоступноеПолеОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Тип Из Элемент.ТипЗначения.Типы() Цикл
			Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
				Продолжить;
			КонецЕсли;
			Если Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
				Продолжить;
			КонецЕсли;
			Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
			Если ОбновитьСписокПолей Тогда
				СтруктураПоля = Новый Структура;
				СтруктураПоля.Вставить("Поле", Строка(Элемент.Поле));
				СтруктураПоля.Вставить("Представление", Элемент.Заголовок);
				СтруктураПоля.Вставить("Идентификатор", Идентификатор);
				НастройкиФормы.ПоляИИдентификаторы.Добавить(СтруктураПоля);
			КонецЕсли;
			Если Элементы.ПривязкаОбъектМетаданных.СписокВыбора.НайтиПоЗначению(Идентификатор) = Неопределено Тогда
				Элементы.ПривязкаОбъектМетаданных.СписокВыбора.Добавить(Идентификатор);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Элементы.ПривязкаОбъектМетаданных.СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Возр);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПолейПривязки()

	Элементы.ПривязкаПолеОтчета.СписокВыбора.Очистить();
	ПривязкаПолеОтчета = Неопределено;
	Если Не ЗначениеЗаполнено(ПривязкаОбъектМетаданных) И Не НастройкиФормы.Свойство("ПоляИИдентификаторы") Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтруктураПоля Из НастройкиФормы.ПоляИИдентификаторы Цикл
		Если Не СтруктураПоля.Идентификатор = ПривязкаОбъектМетаданных Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ПривязкаПолеОтчета.СписокВыбора.Добавить(СтруктураПоля.Поле, СтруктураПоля.Представление);
	КонецЦикла;
	Если Элементы.ПривязкаПолеОтчета.СписокВыбора.Количество() = 1 Тогда
		ПривязкаПолеОтчета = Элементы.ПривязкаПолеОтчета.СписокВыбора[0].Значение;
	КонецЕсли;
	Элементы.ПривязкаПолеОтчета.Доступность = (Элементы.ПривязкаПолеОтчета.СписокВыбора.Количество() > 1);

КонецПроцедуры

&НаСервере
Процедура ПривязкаСохранитьСервер()

	Если Контекст.БезПривязки Тогда
		Возврат;
	КонецЕсли;
	СтрокаПривязки = ПривязкиПолей.Добавить();
	СтрокаПривязки.Объект = ПривязкаОбъектМетаданных;
	СтрокаПривязки.Поле = ПривязкаПолеОтчета;
	СтрокаПривязки.Представление = ПредставлениеПривязки(СтрокаПривязки.ПолучитьИдентификатор());
	ОбновитьЭлементыПривязок();
	Элементы.ГруппаДобавлениеПривязки.Видимость = Ложь;
	Элементы.ДобавитьПривязку.Видимость = Истина;

КонецПроцедуры

&НаСервере
Функция ПредставлениеОтметки(НаименованиеТега, ПометкаУдаления = Ложь)

	Цвет = ЦветаСтиля.ТекстВторостепеннойНадписи;
	Если ПометкаУдаления Тогда
		Шрифт = ШрифтыСтиля.ШрифтПолужирныйЗачеркнутыйУНФ;
	Иначе
		Шрифт = ШрифтыСтиля.ВажнаяНадписьШрифт;
	КонецЕсли;

	Результат = Новый ФорматированнаяСтрока(НаименованиеТега, Шрифт, Цвет);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти
